{
  "account": "ohcnetwork.1password.com",
  "project": {
    "name": "Open Healthcare Network",
    "description": "**Open Healthcare Network (OHC)**, originally established as *Coronasafe Network*, is a pioneering open-source organization dedicated to enhancing healthcare delivery and management. At the core of OHC's innovation is its flagship Electronic Medical Record (EMR) system, recognized as the [50th Digital Public Good by the United Nations](https://digitalpublicgoods.net/). This system transcends being merely a digital repository of patient records, evolving into a platform that supports advanced TeleICU capabilities.\n\nOHC represents a unique fusion of professional expertise and community-driven innovation, primarily fueled by a small team of dedicated developers and a dynamic community of college students. This collaborative model showcases a new paradigm in healthcare technology, emphasizing impactful, sustainable, and scalable solutions.\n\nOriginally a volunteer-driven initiative during the COVID-19 pandemic, OHC has continually addressed citizen-level healthcare problems. Its CARE software, adopted by several Indian states, played a crucial role in optimizing healthcare resource management during the pandemic. As the pandemic waned, CARE evolved to support the 10BedICU Project, enabling technology-driven ICU care in rural India and providing TeleICU services to the remotest regions, impacting thousands of lives.\n\nToday, beyond the 10BedICU Project, CARE is being adopted for various healthcare applications, including palliative care digitization, demonstrating its adaptability and growing significance in improving healthcare delivery across diverse settings. OHC's journey is a testament to the transformative impact of youth-driven initiatives in healthcare, touching the lives of millions across India.",
    "contributors": 25,
    "home_url": "https://ohc.network/",
    "repo_url": "https://github.com/coronasafe/",
    "license_type": "MIT",
    "license_url": "https://github.com/coronasafe/care/blob/develop/LICENSE",
    "is_event": false,
    "is_team": true
  },
  "applicant": {
    "name": "Bodhish Thomas",
    "email": "hey@bodhish.in",
    "role": "Chief Architect \u0026 Co-Founder",
    "id": 14979190
  },
  "can_contact": true,
  "issue_number": 922,
  "created_at": "2024-03-23T21:13:44Z",
  "pull_request_url": "https://github.com/1Password/for-open-source/pull/922"
}